Autodesk.Revit.DB.GlobalParametersManager.DissociateFromProperty(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Dissociates an element's property from a global parameter (any currently associated)
Remarks:
It is assumed that the property has been previously associated with this
global parameter by using the Autodesk.Revit.DB.GlobalParametersManager.AssociateWithProperty(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId) method.
document:
Document containing the element of which property is to be dissociated
elementId:
Id of an element in the given document
parameterId:
Id of the given element's parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
Property with the given parameterId is not parameterizable, and thus cannot be driven by a global parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.AssociateWithProperty(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Associates a global parameter with a property of the given element.
Remarks:
The given property (parameter) must be parameterizable, meaning it cannot be
read-only, driven by a formula, or have any other restrictions imposed by Revit.
The parameter's value type must match the type of this global parameter.
Once associated property can be later dissociated by calling the
Autodesk.Revit.DB.GlobalParametersManager.DissociateFromProperty(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId) method
document:
Document containing a global parameter and an element to be associated with
gpId:
Id of a global parameter contained by the given document
elementId:
Id of an element in the given document
parameterId:
Id of the given element's parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gpId is not of a valid global parameter of the given document.
-or-
The element elementId does not exist in the document
-or-
Property with the given parameterId is either not parameterizable or does not match the type of the global parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.GetGlobalParameterAssociatedWithProperty(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Returns a global parameter, if any, currently associated with the given element property.
Remarks:
InvalidElementId is returned in case the property is not associated with any global parameter.
InvalidElementId is also returned if called for a parameter that cannot even be associated
with a global parameters (i.e. a non-parametrizable parameter or parameter with a formula).
document:
Document containing the given element and its parameter
elementId:
Id of an element in the given document
parameterId:
Id of the given element's parameter
Returns:
Id of a global parameter or InvalidElemetnId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.CanElementParameterAndGPBeAssociated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Tests whether a given parameter of an element can be associated with any global parameter.
Remarks:
Only properties defined as parametrizable can be associated with global parameters.
That excludes any read-only and formula-driven parameters, as well as those that
have other explicit or implicit restrictions imposed by Revit.
document:
Document containing the given element and its parameter
gpId:
Id of a global parameter element
elementId:
Id of an element in the given document
parameterId:
Id of the given element's parameter
Returns:
True if the given parameter is parametrizable and matches the type of the given global parameter; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gpId is not of a valid global parameter of the given document.
-or-
The element elementId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.CanElementParameterBeAssociated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Tests whether a given parameter of an element can be associated with a global parameter.
Remarks:
Only properties defined as parametrizable can be associated with global parameters.
That excludes any read-only and formula-driven parameters, as well as those that
have other explicit or implicit restrictions imposed by Revit.
document:
Document containing the given element and its parameter
elementId:
Id of an element in the given document
parameterId:
Id of the given element's parameter
Returns:
True if the given parameter can be associated (is parametrizable); False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.MoveParameterDownOrder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Moves given paramerer Down in the current order.
Remarks:
A parameter can only be moved within its parameter group, meaning that
repeated moving a parameter will not push the parameter out of and into
the next (in order) parameter group. When a parameter can no longer move
because it is at the boundary of its group, this method returns False.
This operation has no effect on the global parameters themselves.
The rearranged order is only visible in the standard Global Parameters
dialog. However, the order of parameters is serialized in the document,
thus available on the DB level as well.
document:
Document containing the give global parameter
parameterId:
The parameter to move Down
Returns:
Indicates whether the parameter could be moved Down in order or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Global parameters are not supported in the given document.
A possible cause is that it is not a project document,
for global parameters are not supported in Revit families.
-or-
The input parameterId is not of a valid global parameter of the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.GlobalParametersManager.MoveParameterUpOrder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Moves given paramerer Up in the current order.
Remarks:
A parameter can only be moved within its parameter group, meaning that
repeated moving a parameter will not push the parameter out of and into
the next (in order) parameter group. When a parameter can no longer move
because it is at the boundary of its group, this method returns False.
This operation has no effect on the global parameters themselves.
The rearranged order is only visible in the standard Global Parameters
dialog. However, the order of parameters is serialized in the document,
thus available on the DB level as well.
document:
Document containing the give global parameter
parameterId:
The parameter to move up
Returns:
Indicates whether the parameter could be moved Up in order or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Global parameters are not supported in the given document.
A possible cause is that it is not a project document,
for global parameters are not supported in Revit families.
-or-
The input parameterId is not of a valid global parameter of the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.GlobalParametersManager.SortParameters(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ParametersOrder)
Sorts global parameters in the desired order.
Remarks:
All global parameters are sorted, but only within the range
of their respective parameter group.
This operation has no effect on the global parameters themselves.
The sorted order is only visible in the standard Global Parameters
dialog. However, the order of parameters is serialized in the document,
thus available on the DB level as well.
document:
Document containing the global parameters to be sorted
order:
Desired sorting order
Throws Autodesk.Revit.Exceptions.ArgumentException:
Global parameters are not supported in the given document.
A possible cause is that it is not a project document,
for global parameters are not supported in Revit families.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.GlobalParametersManager.GetGlobalParametersOrdered(Autodesk.Revit.DB.Document)
Returns all global paramters in an ordered array.
Remarks:
The order of the items coresponds to the order at which global parameters
appear in Revit UI when shown in the standard Global Parameters dialog.
However, the order of parameters is serialized in the document,
thus available on the DB level as well.
document:
Document containing the requested global parameters
Returns:
An array of Element Ids of all Global Parameters in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Global parameters are not supported in the given document.
A possible cause is that it is not a project document,
for global parameters are not supported in Revit families.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.GlobalParametersManager.IsUniqueName(Autodesk.Revit.DB.Document,System.String)
Tests whether a name is unique among existing global parameters of a given document.
Remarks:
Typically, this method is used before a new global parameters is created, for
all global parameters must have their names unique in the scope of a document.
document:
Document in which a new parameter is to be added.
name:
A name of a parameter being added.
Returns:
True if the given %name% does not exist yet among existing global parameters nof the document; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.IsValidGlobalParameter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Tests whether an ElementId is of a global parameter in the given document.
document:
The document containing the global parameter.
parameterId:
Id of a global parameter
Returns:
Returns True if the Id is of a valid global parameter; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.FindByName(Autodesk.Revit.DB.Document,System.String)
Finds whether a global parameter with the given name exists in the input document.
Remarks:
No exception is thrown when no parameter with such a name exists in the document;
instead, the method returns an ElementId.InvalidElementId.
document:
The document expected to contain the global parameter.
name:
Name of the global parameter
Returns:
ElementId of the parameter element, or InvalidElementId if it was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.GetAllGlobalParameters(Autodesk.Revit.DB.Document)
Returns all global parameters available in the given document.
document:
The document containing the global parameters
Returns:
A collection of Element Ids of global parameter elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Global parameters are not supported in the given document.
A possible cause is that it is not a project document,
for global parameters are not supported in Revit families.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.AreGlobalParametersAllowed(Autodesk.Revit.DB.Document)
Tests whether global parameters are allowed in the given document.
Remarks:
First of all, global parameters can be had in main project documents only;
they are not supported in family documents. However, there may also be other
circumstances due to which global parameters may be disallowed in a particular
project, either temporarily or permanently.
document:
A revit document of interest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParametersManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.GlobalParametersManager
A class to access and query information about global parameters in Revit models.
Remarks:
This class provides access to general information and data of Global Parameter
elements in a particular model. First of all, it is important to know that global
parameters can be had in main project document; there are not supported in family
documents. Availability of global parameters in a document can be tested by calling
Autodesk.Revit.DB.GlobalParametersManager.AreGlobalParametersAllowed(Autodesk.Revit.DB.Document) method.
Global Parameter in a document can be obtained by calling either
Autodesk.Revit.DB.GlobalParametersManager.GetAllGlobalParameters(Autodesk.Revit.DB.Document) or Autodesk.Revit.DB.GlobalParametersManager.FindByName(Autodesk.Revit.DB.Document,System.String).
The former returns a set of all global parameters in the document,
while the latter returns just the requested one, providing it exists.
Each global parameters must be created with a valid name that is unique
in the scope of the document. To test whether a particular name is unique,
programmer can use the Autodesk.Revit.DB.GlobalParametersManager.IsUniqueName(Autodesk.Revit.DB.Document,System.String) method.
More details about creating and manipulating global parameters can be found
in the description of the Autodesk.Revit.DB.GlobalParameter class.
Since:
2016 Subscription Update